Revit 2027 API
WorksetVisibility Enumeration
 Indicates the visibility settings of a workset in a particular view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum WorksetVisibility
Public Enumeration WorksetVisibility
public enum class WorksetVisibility
type WorksetVisibility
Members
Member name | Value | Description
Hidden | 1 |  Be hidden in a view.
UseGlobalSetting | 2 |  Do not override the visibility.
Visible | 0 |  Be visible in a view (i.e. will be visible unless it is closed).
See Also
Reference
Autodesk.Revit.DB Namespace